{
  "manifest": {
    "publishingInformation": {
      "locales": {
        "en-US": {
          "summary": "Play from Spotify playlists covering over 2,600 genres, jump between similar genres, and discover music around the world.",
          "examplePhrases": [
            "Alexa, ask Every Noise to play some dream pop.",
            "Alexa, ask Every Noise to list some genres.",
            "Alexa, ask Every Noise to play a random genre."
          ],
          "keywords": [
            "music",
            "genres",
            "spotify"
          ],
          "name": "Every Noise at Once",
          "smallIconUri": "https://s3.amazonaws.com/CAPS-SSE/echo_developer/4d6406ea3c3f40b18332a9798e7050f8/APP_ICON?versionId=rnUt.uvoEK8q8.TFrMMocDuwWDjPkuP5&AWSAccessKeyId=AKIAIEYXX6DHY7O4XWMA&Expires=1534619978&Signature=8x%2BH5hKHfxSjW6gGzpo5AIPBjIQ%3D",
          "description": "Play over 2,600 musical genres and styles on Spotify by name or at random. Explore similar genres and music from around the world. Follow playlists for genres you discover so you can play them from Spotify anywhere.\n\nThis skill requires a Spotify Premium account to play music and follow playlists. Genre information comes from everynoise.com by Glenn McDonald.\n\n• Listen to any of the genres found on everynoise.com: \"Alexa, ask Every Noise to play some Norwegian punk.\"\n• Find out about some genres you could listen to: \"Alexa, ask Every Noise what can I play?\"\n• Try something at random: \"Alexa, ask Every Noise to play a random genre.\"\n• Try a similar genre: \"Alexa, ask Every Noise to play something else like this.\"\n• Or list all similar genres: \"Alexa, ask Every Noise for similar genres.\"\n• Ask what you're hearing: \"Alexa, ask Every Noise what is this?\"\n• Follow the playlist for a genre you've discovered: \"Alexa, ask Every Noise to follow this playlist.\"\n\nThis skill can play music on any Spotify Connect compatible device, including Amazon Echo. Before using this skill, make sure that you can use the official Spotify app on a phone or computer to control playback on your device. If your Echo does not appear in the Spotify app, try saying \"Alexa, Spotify Connect\" first.\n\nBy default, this skill always will play music on the device you last used with Spotify. If you use Spotify on multiple devices, you may want to lock playback to a specific device:\n\n• Lock to currently playing device: \"Alexa, ask Every Noise to lock the Spotify device.\"\n• Default to the last used device: \"Alexa, ask Every Noise to always use the last device.\"",
          "largeIconUri": "https://s3.amazonaws.com/CAPS-SSE/echo_developer/b6c825079f8c4a90a238601764c311f3/APP_ICON_LARGE?versionId=VFcBqcJScnft.hOQpGdtXLFHLr79PCSf&AWSAccessKeyId=AKIAIEYXX6DHY7O4XWMA&Expires=1534619978&Signature=OH6xdtw4ANmQg9Bor8IA47W6bJ4%3D"
        }
      },
      "isAvailableWorldwide": false,
      "testingInstructions": "This skill requires a Spotify Premium account to play music. Because Amazon does not provide an API to control Spotify, this skill uses the Spotify Connect API and must be configured before use. This skill does NOT use the AudioPlayer interface and MUST be tested with a real Spotify Connect compatible device!\n\nBefore testing this skill, PLEASE be sure to play a song in Spotify on the same account. This skill has been previously rejected but my logs seem to indicate that the certification team did not have a device connected to the Spotify account. By default, this skill will play on the last used device (which was my computer when this Spotify account was last used).\n\nOn an Amazon Echo, make sure that you can use the official Spotify app on a phone or computer to control the Echo before using this skill. After linking the Echo to Spotify, say \"Alexa, Spotify Connect\" then use the Spotify app to select the Echo and play a song.\n\nIf the certification team does not test on an actual Echo, this skill can control any other Spotify Connect device, including the Spotify mobile and desktop apps as well as the Spotify Web Player.",
      "category": "STREAMING_SERVICE",
      "distributionCountries": [
        "AF",
        "AX",
        "AL",
        "DZ",
        "AS",
        "AD",
        "AO",
        "AI",
        "AQ",
        "AG",
        "AR",
        "AM",
        "AW",
        "AU",
        "AT",
        "AZ",
        "BS",
        "BH",
        "BD",
        "BB",
        "BY",
        "BE",
        "BZ",
        "BJ",
        "BM",
        "BT",
        "BO",
        "BA",
        "BW",
        "BV",
        "BR",
        "IO",
        "BN",
        "BG",
        "BF",
        "BI",
        "KH",
        "CM",
        "CA",
        "CV",
        "KY",
        "CF",
        "TD",
        "CL",
        "CN",
        "CX",
        "CC",
        "CO",
        "KM",
        "CG",
        "CD",
        "CK",
        "CR",
        "HR",
        "CY",
        "CZ",
        "DK",
        "DJ",
        "DM",
        "DO",
        "EC",
        "EG",
        "SV",
        "GQ",
        "ER",
        "EE",
        "ET",
        "FK",
        "FO",
        "FJ",
        "FI",
        "FR",
        "GF",
        "PF",
        "TF",
        "GA",
        "GM",
        "GE",
        "DE",
        "GH",
        "GI",
        "GR",
        "GL",
        "GD",
        "GP",
        "GU",
        "GT",
        "GG",
        "GN",
        "GW",
        "GY",
        "HT",
        "HM",
        "VA",
        "HN",
        "HK",
        "HU",
        "IS",
        "IN",
        "ID",
        "IQ",
        "IE",
        "IM",
        "IL",
        "IT",
        "CI",
        "JM",
        "JP",
        "JE",
        "JO",
        "KZ",
        "KE",
        "KI",
        "KR",
        "KW",
        "KG",
        "LA",
        "LV",
        "LB",
        "LS",
        "LR",
        "LY",
        "LI",
        "LT",
        "LU",
        "MO",
        "MK",
        "MG",
        "MW",
        "MY",
        "MV",
        "ML",
        "MT",
        "MH",
        "MQ",
        "MR",
        "MU",
        "YT",
        "MX",
        "FM",
        "MD",
        "MC",
        "MN",
        "ME",
        "MS",
        "MA",
        "MZ",
        "MM",
        "NA",
        "NR",
        "NP",
        "NL",
        "AN",
        "NC",
        "NZ",
        "NI",
        "NE",
        "NG",
        "NU",
        "NF",
        "MP",
        "NO",
        "OM",
        "PK",
        "PW",
        "PS",
        "PA",
        "PG",
        "PY",
        "PE",
        "PH",
        "PN",
        "PL",
        "PT",
        "PR",
        "QA",
        "RE",
        "RO",
        "RU",
        "RW",
        "BL",
        "SH",
        "KN",
        "LC",
        "MF",
        "PM",
        "VC",
        "WS",
        "SM",
        "ST",
        "SA",
        "SN",
        "RS",
        "SC",
        "SL",
        "SG",
        "SK",
        "SI",
        "SB",
        "SO",
        "ZA",
        "GS",
        "ES",
        "LK",
        "SR",
        "SJ",
        "SZ",
        "SE",
        "CH",
        "TW",
        "TJ",
        "TZ",
        "TH",
        "TL",
        "TG",
        "TK",
        "TO",
        "TT",
        "TN",
        "TR",
        "TM",
        "TC",
        "TV",
        "UG",
        "UA",
        "AE",
        "GB",
        "US",
        "UM",
        "UY",
        "UZ",
        "VU",
        "VE",
        "VN",
        "VG",
        "VI",
        "WF",
        "EH",
        "YE",
        "ZM",
        "ZW"
      ]
    },
    "apis": {
      "custom": {
        "endpoint": {
          "sourceDir": "."
        },
        "interfaces": []
      }
    },
    "manifestVersion": "1.0",
    "privacyAndCompliance": {
      "allowsPurchases": false,
      "locales": {
        "en-US": {
          "privacyPolicyUrl": "https://everynoise-alexa.s3.amazonaws.com/privacy.html"
        }
      },
      "isExportCompliant": true,
      "containsAds": false,
      "isChildDirected": false,
      "usesPersonalInfo": false
    }
  }
}
